import { Title, Text, Box } from "@mantine/core";
import { hideNotification } from "@mantine/notifications";
import { LegalCard } from "features/legal/components/LegalCard";
import { useEffect } from "react";
import { SitePage } from "types";

const LegalPage: SitePage = () => {
  useEffect(() => {
    hideNotification("legal");
    localStorage.legalVisited = "yes";
  });

  return (
    <LegalCard
      sx={{
        "ol ol": {
          listStyle: "none",
        },
        "ol ol li::before": {
          content: "''",
          display: "inline-block",
          marginLeft: -24,
        },
      }}
    >
      <Title mb="xl" size="h1">
        Правила користування вебсайтом
      </Title>
      <Text component="p">
        версія 01
        <br />
        від 14 вересня 2022 року
      </Text>

      <Text component="p">
        Ці правила користування вебсайтом (далі — <strong>Правила</strong>)
        розроблено з метою:
      </Text>

      <Text component="p">
        1) ознайомити користувачів Вебсайту (далі — <strong>Ви</strong>) з
        їхніми правами й обов’язками в процесі користування послугами, які надає
        Вебсайт (далі — <strong>Послуги</strong>);
      </Text>

      <Text component="p">
        2) зробити комфортною взаємодію спільноти учасників Вебсайту; а також
      </Text>

      <Text component="p">
        Текст Правил викладено нижче в наступних розділах з підзаголовками, які
        використано виключно з метою спростити читання й розуміння цього
        документа.
      </Text>

      <Box component="ol">
        <Box component="li">
          <strong>Ваші правовідносини з Адміністрацією</strong>
        </Box>

        <Box component="ol">
          <Box component="li">
            1.1 <strong>Правоздатність і дієздатність.</strong> Ви підтверджуєте
            й гарантуєте, що володієте тим обсягом правоздатності та
            дієздатності, який потрібен для виникнення цих правовідносин згідно
            із законодавством, що застосовується до цих правовідносин.
          </Box>
          <Box component="li">
            1.2 <strong>Момент виникнення правовідносин.</strong> Моментом
            виникнення правовідносин між Вами й Адміністрацією є: (А)
            проставлення позначки в рядку «згоден», якщо ця позначка доступна в
            користувацькому інтерфейсі Вебсайту на момент прийняття Вами цих
            Правил; (Б) фактичне користування Вебсайтом. В останньому випадку Ви
            визнаєте, що одноразове фактичне користування Вами Вебсайтом означає
            прийняття Вами цих Правил і надалі. ВИ НЕ МОЖЕТЕ ПРОДОВЖУВАТИ
            КОРИСТУВАТИСЯ ВЕБСАЙТОМ, ЯКЩО НЕ ЗГОДНІ ІЗ ЦИМИ ПРАВИЛАМИ.
          </Box>
          <Box component="li">
            1.3 <strong>Складові частини Правил.</strong> Ваші правовідносини з
            Адміністрацією регулюють ці Правила, у чинній редакції або такій, що
            була чинною на момент виникнення відповідних правовідносин, а також
            сповіщення від Адміністрації.
          </Box>
          <Box component="li">
            1.4 <strong>Направлення й отримання сповіщень.</strong> Уповноважені
            представники Адміністрації можуть, але не зобов’язані, надсилати на
            зазначену Вами під час реєстрації адресу електронної пошти
            сповіщення про прийняття й набуття чинності нових версій Правил, а
            також інші сповіщення, що стосуються Вас.
          </Box>
          <Box component="li">
            1.5 <strong>Приватні сповіщення.</strong> У разі потреби надіслати
            приватне (тобто таке, що стосується тільки Вас) сповіщення
            уповноважені представники Адміністрації надішлють це сповіщення на
            зазначену Вами під час реєстрації адресу електронної пошти. Ви
            зобов’язуєтеся самостійно стежити за електронною поштовою скринькою
            адреси електронної пошти, указаної Вами під час реєстрації.
          </Box>
          <Box component="li">
            1.6 <strong>Повідомлення для Адміністрації.</strong> У разі потреби
            повідомити Адміністрації яку-небудь інформацію, надання якої
            вимагають законодавство України, ці Правила чи інші документи, Ви
            можете використовувати адресу електронної пошти:{" "}
            <a href="mailto:jmas.ukraine@gmail.com">jmas.ukraine@gmail.com</a>.
            Окрім випадків, коли це вимагає відповідне законодавство,
            Адміністрація може, але не зобов’язана відповідати на Ваші
            електронні повідомлення.
          </Box>
          <Box component="li">
            1.7 <strong>Архів версій і сповіщень.</strong> З актуальною версією
            й архівом усіх попередніх версій цих Правил, так само як і з архівом
            окремих сповіщень, Ви можете ознайомитися за адресою{" "}
            <a href="https://ujounral.com.ua/new/legal/">
              ujounral.com.ua/new/legal
            </a>
            .
          </Box>
          <Box component="li">
            1.8 <strong>Незареєстровані користувачі.</strong> Якщо Ви
            незареєстрований користувач, Ви зобов’язуєтеся самостійно стежити за
            всіма змінами до цих Правил, а також за всіма сповіщеннями, що
            стосуються Вас.
          </Box>
        </Box>

        <Box component="li">
          <strong>Порядок надання Послуг</strong>
        </Box>

        <Box component="ol">
          <Box component="li">
            2.1 <strong>Можливі зміни.</strong> Адміністрація і її партнери
            постійно вдосконалюють Послуги з метою підвищення їхньої якості. Ви
            визнаєте й погоджуєтеся з тим, що форма та характер Послуг можуть
            час від часу змінюватися. Ви також визнаєте й погоджуєтеся з тим, що
            Адміністрація не зобов’язана надавати Вам особливе сповіщення в разі
            реалізації подібних змін, а також з тим, що надання Послуг може бути
            припинено Адміністрацією в будь-який момент без надсилання Вам
            особливого сповіщення.
          </Box>
          <Box component="li">
            2.2 <strong>Цільове використання послуг.</strong> Ви зобов’язуєтеся
            використовувати Послуги тільки для цілей, що дозволені чинним
            законодавством України, а також законодавством країни, з якої Ви
            здійснюєте доступ до Вебсайту.
          </Box>
          <Box component="li">
            2.3 <strong>Ідентифікація особи.</strong> Ви визнаєте й погоджуєтеся
            з тим, що для використання окремих Послуг Вам необхідно буде
            ідентифікувати свою особу та зазначити свою контактну інформацію
            (наприклад, адресу фактичного проживання й контактний телефон). Ви
            також визнаєте й погоджуєтеся з тим, що в разі Вашого небажання
            ідентифікувати свою особу та зазначати свою контактну інформацію Ваш
            доступ до Вебсайту або до окремих його Послуг можуть заборонити.
          </Box>
          <Box component="li">
            2.4 <strong>Логін, пароль і їхнє збереження.</strong> Ви визнаєте й
            погоджуєтеся з тим, що є єдиною особою, відповідальною за збереження
            та конфіденційність Вашого логіна й пароля доступу до Вебсайту, а
            також будь-яких інших даних, потрібних для цього доступу. У разі
            отримання третіми особами Вашого логіна й пароля доступу до Вебсайту
            внаслідок Вашого бажання чи необережності Ви є особисто матеріально
            відповідальними за наслідки дій цих третіх осіб.
          </Box>
          <Box component="li">
            2.5 <strong>Спосіб доступу.</strong> Ви зобов’язуєтеся здійснювати
            доступ до Вебсайту виключно через користувацький інтерфейс. Зокрема,
            Ви зобов’язуєтеся не здійснювати доступ до Вебсайту через
            автоматизовані програмні засоби з метою, з-поміж усього іншого,
            автоматичного збирання розміщеної на сайті інформації без згоди
            Адміністрації.
          </Box>
          <Box component="li">
            2.6 <strong>Згода на перегляд реклами.</strong> Безоплатне надання
            деяких Послуг фінансується з прибутків від реклами. Зважаючи на це,
            Ви погоджуєтеся з тим, що Послуги можуть містити рекламу. Подібна
            реклама може орієнтуватися на інформаційний зміст Послуг, запитів,
            що здійснюються в процесі використання Послуг, або на іншу
            інформацію. Адміністрація може змінювати порядок, форму й обсяг
            реклами, що розміщується в Послугах, без надання Вам окремого
            сповіщення. Ураховуючи безоплатний характер надання доступу до
            Послуг, Ви погоджуєтеся, що Адміністрація має право розміщати
            рекламу в Послугах.
          </Box>
          <Box component="li">
            2.7 <strong>Відмова від шкідливої діяльності.</strong> Ви
            зобов’язуєтеся не здійснювати діяльність, результатом якої може
            стати тимчасова або постійна непрацездатність Вебсайту, обладнання,
            яке його підтримує, програмного забезпечення, або в результаті якої
            буде заподіяно або ж стане можливим заподіяння шкоди іншим
            користувачам Вебсайту й мережі Інтернет загалом.
          </Box>
          <Box component="li">
            2.8 <strong>Відмова від неетичної поведінки.</strong> Ви
            зобов’язуєтеся не використовувати під час взаємодії з Адміністрацією
            або іншими користувачами Вебсайту лайку, а також вислови,
            зображення, відеозаписи й звуки, які ображають честь і гідність
            інших користувачів Вебсайту. Адміністрація має право на свій розсуд,
            без попереджень і будь-яких додаткових роз’яснень тимчасово
            припинити або припинити взагалі надавати Послуги користувачу, щодо
            якого надійшла скарга від іншого користувача Вебсайту.
          </Box>
        </Box>

        <Box component="li">
          <strong>Права на створені Вами твори</strong>
        </Box>

        <Box component="ol">
          <Box component="li">
            3.1 <strong>Передання прав.</strong> Цим Ви передаєте Адміністрації
            всі виключні майнові права на всі твори, за винятком розміщеного
            Вами на Вебсайті програмного забезпечення, зокрема права на
            літературні, науково-технічні, візуальні й аудіовізуальні твори,
            створені Вами в процесі користування Послугами. Моментом передання
            прав є отримання відповідного твору у формі електронних даних на
            сервер, який контролює Адміністрація. Як винагороду за передання
            прав Адміністрація надає Вам безоплатний доступ до Послуг.
          </Box>
          <Box component="li">
            3.2 <strong>Creative Commons.</strong> За винятком випадків, коли
            розміщену на Вебсайті копію твору супроводжує письмове повідомлення
            про інше, цим Адміністрація надає Вам персональну, безоплатну,
            невиключну ліцензію, що діє на території всього світу, на
            некомерційне використання всіх опублікованих на Вебсайті творів на
            умовах ліцензування Creative Commons BY-NC-SA, з актуальною версією
            яких англійською мовою можна ознайомитися за адресою{" "}
            <a href="http://creativecommons.org/licenses/by-nc-sa/3.0">
              http://creativecommons.org/licenses/by-nc-sa/3.0
            </a>
            . Якщо ви невпевнені в тому, чи є використання опублікованих Вами на
            Вебсайті творів некомерційним, а також щодо того, чи виконали Ви всі
            умови ліцензування Creative Commons BY-NC-SA, зв’яжіться з
            Адміністрацією за адресою jmas.ukraine@gmail.com.
          </Box>
          <Box component="li">
            3.3 <strong>Права на програмне забезпечення.</strong> Якщо Ви
            публікуєте на Вебсайті програмне забезпечення, права на це програмне
            забезпечення, а також права на всі твори, які є його складовими
            частинами, залишаються у Вас. Ви самі визначаєте умови ліцензування
            кінцевим користувачам програмного забезпечення, що належить Вам. Для
            цілей публікування цього програмного забезпечення на Вебсайті Ви
            надаєте Адміністрації безоплатну, невиключну ліцензію, що діє на
            території всього світу, на публікування на Вебсайті програмного
            забезпечення, що належить Вам. Як винагороду за передання зазначених
            у цьому пункті прав Адміністрація надає Вам безоплатний доступ до
            Послуг.
          </Box>
          <Box component="li">
            3.4 <strong>Гарантія наявності прав.</strong> Ви підтверджуєте й
            гарантуєте, що володієте всіма необхідними правами на твори, які Ви
            розміщаєте на Вебсайті, включно з програмним забезпеченням. У разі
            висунення претензій до Адміністрації або ініціювання судових та
            інших позовів Ви зобов’язуєтеся надавати Адміністрації будь-яке
            потрібне в такому випадку сприяння. У разі, якщо відповідний
            державний орган або інша компетентна установа встановить, що ви не
            володієте всіма потрібними правами на твори, які Ви розмістили на
            Вебсайті, включно з програмним забезпеченням, Ви зобов’язуєтеся
            компенсувати Адміністрації всі збитки, витрати, які зазнала
            Адміністрація внаслідок порушення Вами положень цього пункту Правил.
          </Box>
        </Box>

        <Box component="li">
          <strong>Виключення гарантій та обмеження відповідальності</strong>
        </Box>

        <Box component="ol">
          <Box component="li">
            4.1 <strong>Вам ніхто нічого не винен.</strong> Ви визнаєте й
            погоджуєтеся з тим, що Послуги надаються Вам на безоплатній основі
            «як є», тобто без будь-яких гарантійних та інших зобов’язань, крім
            тих, які передбачають ці Правила й законодавство України.
          </Box>
          <Box component="li">
            4.2 <strong>Наслідки порушення правил.</strong> Ви визнаєте й
            погоджуєтеся з тим, що Адміністрація не є відповідальною ні перед
            Вами, ні перед третіми особами ні за порушення Вами цих правил, ні
            за наслідки такого порушення.
          </Box>
          <Box component="li">
            4.3 <strong>Дії третіх осіб.</strong> Ви визнаєте й погоджуєтеся з
            тим, що Адміністрація надає Вам послуги в партнерстві з третіми
            особами. Ви також визнаєте й погоджуєтеся з тим, що в процес надання
            Вам послуг можуть незаконно втручатися треті особи, на дії яких
            Адміністрація вплинути не в силі. Згідно із цим пунктом Правил Ви
            погоджуєтеся, наскільки це можливо згідно із законодавством України,
            а також країни, з якої Ви здійснюєте доступ до Вебсайту, не
            притягувати Адміністрацію до матеріальної відповідальності за
            наслідки дій чи бездіяльності вищезгаданих третіх осіб.
          </Box>
          <Box component="li">
            4.4 <strong>Норми моралі.</strong> Наскільки це можливо відповідно
            до законодавства України, а також країни, з якої Ви здійснюєте
            доступ до Вебсайту, Ви визнаєте й погоджуєтеся з тим, що зміст
            опублікованої на Вебсайті інформації може бути спірним або
            непристойним, а також не відповідати Вашому розумінню норм
            суспільної моралі. З цього погляду Ви визнаєте й погоджуєтеся з тим,
            що користуєтеся Послугами за власним бажанням і розсудом та
            зобов’язуєтеся не висувати будь-які претензії до Адміністрації, а
            також не ініціювати проти Адміністрації будь-які судові,
            адміністративні чи інші позови.
          </Box>
          <Box component="li">
            4.5{" "}
            <strong>
              Збої, помилки, тимчасова чи постійна непрацездатність.
            </strong>{" "}
            Адміністрація не надає ніяких запевнень або гарантій про те, що
            використання Вами Послуг не буде перериватися, що надання Вам Послуг
            не буде тимчасово припинено або припинено назавжди, що Ваш доступ до
            Послуг буде безпечним і буде завжди можливим у зручний для Вас час,
            що в роботі Вебсайту не буде помилок або збоїв, а дефекти роботи
            Вебсайту виправлятимуть.
          </Box>
          <Box component="li">
            4.6 <strong>Сповіщення про проблеми.</strong> У разі виявлення Вами
            спірної, непристойної, неточної або неправдивої інформації, а також
            у разі виявлення Вами тимчасової непрацездатності Вебсайту Ви можете
            повідомити про це Адміністрацію за адресою jmas.ukraine@gmail.com.
          </Box>
        </Box>

        <Box component="li">
          <strong>Припинення Ваших правовідносин з Адміністрацією</strong>
        </Box>

        <Box component="ol">
          <Box component="li">
            5.1 Ці Правила підлягають застосуванню до Ваших правовідносин з
            Адміністрацією до моменту припинення їхньої дії за Вашою ініціативою
            або за ініціативою Адміністрації, як зазначено нижче.
          </Box>
          <Box component="li">
            5.2 Якщо ви хочете припинити Ваші правовідносини з Адміністрацією,
            ви можете зробити це, надіславши Адміністрації сповіщення в
            будь-який час на адресу електронної пошти jmas.ukraine@gmail.com і
            скасувавши Ваш акаунт на Вебсайті.
          </Box>
          <Box component="li">
            5.3 Адміністрація має право в будь-який час припинити дію угоди з
            Вами, якщо: (A) Ви порушили будь-яке положення Правил (або вчинили
            дії, які безпосередньо вказують на те, що Ви не маєте наміру або не
            здатні дотримуватися положень цих Правил); або (Б) Адміністрація
            зобов’язана зробити це через закон (наприклад, у випадках, коли
            надання Вам Послуг є або стає незаконним); або (В) партнер
            Адміністрації, разом з яким вона пропонує Вам Послуги, припинив свої
            відносини з Адміністрацією або більше не пропонує Вам Послуги; або
            (Г) Адміністрація припиняє надавати Послуги користувачам, які
            перебувають на території держави, з якої Ви здійснюєте доступ до
            Вебсайту; або (Д) надання Послуг більше не є комерційно доцільним.
          </Box>
          <Box component="li">
            5.4 У разі припинення дії цих Правил таке припинення не впливає на
            будь-які права, зобов’язання й відповідальність, набуті Вами або
            Адміністрацією та застосовані до Вас чи Адміністрації або такі, що
            виникли протягом дії Умов.
          </Box>
        </Box>
      </Box>

      <Text component="p">
        <strong>Захист персональних даних</strong>
      </Text>

      <Text component="p">
        Оброблення персональних даних здійснюється згідно із законом «
        <a href="http://zakon2.rada.gov.ua/laws/show/2297-17">
          Про захист персональних даних
        </a>
        ».
      </Text>

      <Text component="p">
        Ви дозволяєте Адміністрації сайту ujournal.com.ua збирати й обробляти
        Ваші персональні дані. З правами, що виникають у зв’язку з обробленням
        Ваших персональних даних, цілями оброблення й використання Ваших
        персональних даних ознайомлені.
      </Text>
    </LegalCard>
  );
};

export default LegalPage;
